Revit 2017 API
FabricSheet.BentFabricWiresOrientation Property
 Specifies the location of the straight bars in the fabric sheet.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2016
Syntax
C#
[ObsoleteAttribute("This property is obsolete in Revit 2017. Use BentFabricStraightWiresLocation instead.")]
public BentFabricWiresOrientation BentFabricWiresOrientation { get; set; }
Visual Basic
<ObsoleteAttribute("This property is obsolete in Revit 2017. Use BentFabricStraightWiresLocation instead.")> _
Public Property BentFabricWiresOrientation As BentFabricWiresOrientation
	Get
	Set
Visual C++
[ObsoleteAttribute(L"This property is obsolete in Revit 2017. Use BentFabricStraightWiresLocation instead.")]
public:
property BentFabricWiresOrientation BentFabricWiresOrientation {
	BentFabricWiresOrientation get ();
	void set (BentFabricWiresOrientation value);
}
Remarks
 This property applies only to bent fabric sheets.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: the data-setting method is not applicable to fabric sheets that are flat
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
Autodesk.Revit.Exceptions.InvalidObjectException |  When setting this property: The data-setting method is not applicable to fabric sheets that are flat.
See Also
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace